app/controllers/cards_controller.rb

  def index
    @cards = Card.all
---
SELECT * FROM "cards"

  def show
    @card = Card.find(params[:id])
---
SELECT * FROM "cards" WHERE ("cards"."id" = 1)

  def create
    @card = Card.new(params[:card])

    respond_to do |format|
      if @card.save
---
INSERT INTO "cards" ("updated_at", "title", "body", "user_id", "created_at") VALUES('2009-08-30 23:22:41', 'test card 2', '#2', NULL, '2009-08-30 23:22:41')