app/controllers/users_controller.rb

INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "persistence_token", "email", "created_at") VALUES('2009-08-29 20:06:36', 'c46258649a7b2c559b7aa91499b975b7940e8e6ec4a5ed0941f310fe977a54e9dfbb5b3ba8c60e88fe4e46d21e40545248d20ded7bc1930bce27b6e392bcdc32', 'kylepowers', 'AZfYJqxg4_GyqFvZvjs6', 'abe133d23a91125626ee30e65bfa986b03c8a56f2e68deef629e5b5b849eade9bd63b2ae9858f67b772d710bdfb20a06ca2e768a2d23d17c953a8bcdfa3f60e2', 'kylepowers@gmail.com', '2009-08-29 20:06:36')
---
  def create
    @user = User.new(params[:user])
    if @user.save